# pymysql ÌÖåÏä§Ìä∏

In [1]:
import pymysql

In [3]:
conn = pymysql.connect(
  host='localhost', user='root', passwd='1234'
  , db='my_db', charset='utf8'
)
conn

In [4]:
cursor = conn.cursor()
cursor

In [6]:
sql_query = """SELECT ename, sal, job
FROM emp;
"""

cursor.execute(sql_query)
result = cursor.fetchall()
result

(('SMITH', Decimal('800.00'), 'CLERK'),
 ('ALLEN', Decimal('1600.00'), 'SALESMAN'),
 ('WARD', Decimal('1250.00'), 'SALESMAN'),
 ('JONES', Decimal('2975.00'), 'MANAGER'),
 ('MARTIN', Decimal('1250.00'), 'SALESMAN'),
 ('BLAKE', Decimal('2850.00'), 'MANAGER'),
 ('CLARK', Decimal('2450.00'), 'MANAGER'),
 ('SCOTT', Decimal('3000.00'), 'ANALYST'),
 ('KING', Decimal('5000.00'), 'PRESIDENT'),
 ('TURNER', Decimal('1500.00'), 'SALESMAN'),
 ('ADAMS', Decimal('1100.00'), 'CLERK'),
 ('JAMES', Decimal('950.00'), 'CLERK'),
 ('FORD', Decimal('3000.00'), 'ANALYST'),
 ('MILLER', Decimal('1300.00'), 'CLERK'))

In [7]:
import pandas as pd
pd.DataFrame(result)

         0        1          2
0    SMITH   800.00      CLERK
1    ALLEN  1600.00   SALESMAN
2     WARD  1250.00   SALESMAN
3    JONES  2975.00    MANAGER
4   MARTIN  1250.00   SALESMAN
5    BLAKE  2850.00    MANAGER
6    CLARK  2450.00    MANAGER
7    SCOTT  3000.00    ANALYST
8     KING  5000.00  PRESIDENT
9   TURNER  1500.00   SALESMAN
10   ADAMS  1100.00      CLERK
11   JAMES   950.00      CLERK
12    FORD  3000.00    ANALYST
13  MILLER  1300.00      CLERK

In [9]:
# Ïó∞Í≤∞Í≥º Ïª§ÏÑú Îã´Í∏∞
cursor.close()
conn.close()

# pip install mysqlclient

In [ ]:
import MySQLdb
# MySQL ÏÑúÎ≤ÑÏóê Ïó∞Í≤∞ Ï†ïÎ≥¥
db_config = {
'host' :'localhost',  # Ìò∏Ïä§Ìä∏ Ïù¥Î¶Ñ
'user' : 'root', # MySQL ÏÇ¨Ïö©Ïûê Ïù¥Î¶Ñ
'passwd' : '1234', # MySQL ÏÇ¨Ïö©Ïûê ÎπÑÎ∞ÄÎ≤àÌò∏
'db' : 'my_db', # Ïó∞Í≤∞Ìï† Îç∞Ïù¥ÌÑ∞Î≤†Ïù¥Ïä§ Ïù¥Î¶Ñ
'charset' : 'utf8'
}

In [11]:
try:
    conn = MySQLdb.connect(**db_config) # Ïª§ÏÑú ÏÉùÏÑ±
    cursor = conn.cursor() # ÏøºÎ¶¨ Ïã§Ìñâ ÏòàÏãú
    sql_query = "SELECT * FROM dept"
    cursor.execute(sql_query) # ÏøºÎ¶¨ Í≤∞Í≥º Í∞ÄÏ†∏Ïò§Í∏∞
    result = cursor.fetchall() # Í≤∞Í≥º Ï∂úÎ†•
    for row in result:
        print(row)
except MySQLdb.Error as e:
    print(f"Error: {e}")
finally: # Ïó∞Í≤∞Í≥º Ïª§ÏÑú Îã´Í∏∞
    cursor.close()
    conn.close()

(10, 'ACCOUNTING', 'NEW YORK')
(20, 'RESEARCH', 'DALLAS')
(30, 'SALES', 'CHICAGO')
(40, 'OPERATIONS', 'BOSTON')

# SQLAlchemy

In [13]:
from sqlalchemy import create_engine
import pandas as pd

engine = create_engine("mysql+pymysql://root:1234@localhost/my_db")
engine

Engine(mysql+pymysql://root:***@localhost/my_db)

In [14]:
df = pd.read_sql("SHOW TABLES IN my_db;", engine)
df.head()

  Tables_in_my_db
0            dept
1             emp
2        products
3      products_1
4      products_2

In [15]:
from sqlalchemy import create_engine, Column, Integer, String
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import sessionmaker

# ORM Í∏∞Î≥∏ ÌÅ¥ÎûòÏä§ ÏÉùÏÑ±
Base = declarative_base()

C:\Users\Admin\AppData\Local\Temp\ipykernel_22572\52000807.py:6: MovedIn20Warning: The ``declarative_base()`` function is now available as sqlalchemy.orm.declarative_base(). (deprecated since: 2.0) (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  Base = declarative_base()

In [16]:
# products ÌÖåÏù¥Î∏î Ï†ïÏùò
class Product(Base):
    __tablename__ = 'products'

    id = Column(Integer, primary_key=True, autoincrement=True)
    name = Column(String(100), nullable=False)
    price = Column(Integer, nullable=False)
    stock = Column(Integer, nullable=False)

    def __repr__(self):
        return f"<Product(id={self.id}, name='{self.name}', price={self.price}, stock={self.stock})>"

In [17]:
# ÌÖåÏù¥Î∏î ÏÉùÏÑ±
Base.metadata.create_all(engine)

In [18]:
Session = sessionmaker(bind=engine)
session = Session()

In [ ]:
def add_product(name, price, stock):
    new_product = Product(name=name, price=price, stock=stock)
    session.add(new_product) #insert
    session.commit()
    print(f"üÜï '{name}' ÏÉÅÌíàÏù¥ Îì±Î°ùÎêòÏóàÏäµÎãàÎã§!")


add_product("Î°§Î¶¨Ìåù", 500, 10)
add_product("Ìï´Ï¥àÏΩî", 2000, 10)

üÜï 'Î°§Î¶¨Ìåù' ÏÉÅÌíàÏù¥ Îì±Î°ùÎêòÏóàÏäµÎãàÎã§!
üÜï 'Ìï´Ï¥àÏΩî' ÏÉÅÌíàÏù¥ Îì±Î°ùÎêòÏóàÏäµÎãàÎã§!

In [20]:
def list_products():
    products = session.query(Product).all() #select
    for p in products:
        print(p)

list_products()

<Product(id=1, name='Î°§Î¶¨Ìåù', price=500, stock=10)>
<Product(id=2, name='Ìï´Ï¥àÏΩî', price=2000, stock=10)>

In [ ]:
try:
    # ÏûëÏóÖ
    product = session.query(Product).get(1)
    product.price += 500
    session.commit()
except Exception as e:
    session.rollback()
    print("ÏòàÏô∏ Î∞úÏÉù, Î°§Î∞±:", e)
finally:
    session.close()
    print("ÏÑ∏ÏÖò Ï¢ÖÎ£å")

ÏÑ∏ÏÖò Ï¢ÖÎ£å

C:\Users\Admin\AppData\Local\Temp\ipykernel_22572\1734247740.py:3: LegacyAPIWarning: The Query.get() method is considered legacy as of the 1.x series of SQLAlchemy and becomes a legacy construct in 2.0. The method is now available as Session.get() (deprecated since: 2.0) (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  product = session.query(Product).get(1)

: